package bank;

import java.util.Random;

public class BankTask {	//화면
//	은행은 3개 선언
//	부모 - Bank 
//	공통기능!  - 출금, 입금, 잔액조회, 계좌개설, 계좌번호 중복검사, 로그인, 핸드폰 번호 중복검사
//	자식 - Nh(입금 시 수수료 50%), Kb(출금 시 수수료 50%), Ibk(잔액조회 시 재산 반토막)
	
//	모든 은행 고객을 관리하는 DB를 2차원 배열로 선언.
//	{ {예금주 계좌번호 핸드폰번호 비밀번호 통장잔고},  {예금주 계좌번호 핸드폰번호 비밀번호 통장잔고}, {예금주 계좌번호 핸드폰번호 비밀번호 통장잔고} {...}... }
	
//	모든 은행은 출금, 입금, 잔액조회, 계좌개설, 계좌번호 중복검사, 로그인, 핸드폰 번호 중복검사
//	서비스가 있다.
	
//	화면쪽 메뉴는 계좌개설, 입금하기, 출금하기, 잔액조회, 계좌번호 찾기(새로운 계좌 발급), 나가기
	public static void main(String[] args) {
		
	
	}
}

